module.exports = {
    "Математичний аналіз": "analysis",
    "Теорія ймовірностей і математична статистика": "statistics",
    "Об’єктно-орієнтоване програмування": "oop",
    "Веб-технології": "web",
    "Алгоритми та структури даних": "algorithms",
    "Українська мова, професійне та академічне письмо": "ukrainian",
    "Іноземна мова": "english",
    "Фізвиховання": "pe",
    
    "analysis": "Математичний аналіз",
    "statistics": "Теорія ймовірностей і математична статистика",
    "oop": "Об’єктно-орієнтоване програмування",
    "web": "Веб-технології",
    "algorithms": "Алгоритми та структури даних",
    "ukrainian": "Українська мова, професійне та академічне письмо",
    "english": "Іноземна мова",
    "pe": "Фізвиховання",

    "1": "analysis",
    "2": "statistics",
    "3": "oop",
    "4": "web",
    "5": "algorithms",
    "6": "ukrainian",
    "7": "english",
    "8": "pe",
}

